/***************************************************************************
本程序可供学习使用，经作者允许，也可用于其他用途。如有意见及建议，欢迎来电交流指教
硬件说明：四路麦轮多功能控制板
主控芯片：STM32F103RCT6
程序名称：LED程序



*****************************************************************************/

#include "led.h"

void LED_Init(void)
{
	RCC->APB2ENR|=1<<0;			//使能辅助时钟
	RCC->APB2ENR|=1<<5;    	//使能PORTD时钟	   	 
	GPIOD->CRL&=0XFFFFF0FF; 
	GPIOD->CRL|=0X00000300;	//PD2 推挽输出   	 
  GPIOD->ODR|=1<<2;      	//PD2 输出高 
}



/*************************************END************************************/

