/***************************************************************************
本程序可供学习使用，经作者允许，也可用于其他用途。如有意见及建议，欢迎来电交流指教
硬件说明：四路麦轮多功能控制板
主控芯片：STM32F103RCT6
程序名称：LED程序


*****************************************************************************/


#ifndef __LED_H
#define __LED_H	 
#include "sys.h"

#define LED_ON 		0
#define LED_OFF 	1

#define LED0 PDout(2)	//定义LED0的端口为PD2

void LED_Init(void);	//LED端口初始化

#endif



/*************************************END************************************/

