/***************************************************************************
本程序可供学习使用，经作者允许，也可用于其他用途。如有意见及建议，欢迎来电交流指教
硬件版本：四路麦轮多功能控制板
主控芯片：STM32F103RCT6
程序名称：按键实验--主程序
功能描述：按键控制LED亮灭
*****************************************************************************
修改说明：
无


*****************************************************************************/



#include "sys.h"	
#include "delay.h"	
#include "led.h"
#include "key.h"

int main(void)
{		
	unsigned char LED_sta=0;
  Stm32_Clock_Init(9);//系统时钟设置，8.0000MHz晶振，9倍倍频，主频=8.0000MHz*9=72.0000MHz 
	delay_init(72);			//延时初始化
	LED_Init();         //LED初始化	
	KEY_Init();         //按键初始化
	while(1)						//主循环
	{
		if(KEY==KEY_DOWN)	//按键按下
		{
			while(KEY==KEY_DOWN);//等待按键释放
			LED_sta=~LED_sta;		
		}
		
		if(LED_sta==0)
			LED0=LED_OFF;			//LED灯灭
		else
			LED0=LED_ON;			//LED灯亮
	} 
}

/*************************************END************************************/







