/***************************************************************************
本程序可供学习使用，经作者允许，也可用于其他用途。如有意见及建议，欢迎来电交流指教
硬件版本：四路麦轮多功能控制板
主控芯片：STM32F103RCT6
程序名称：按键端口初始化程序
功能描述：独立按键程序



*****************************************************************************/


#include "key.h"
#include "delay.h"
						    
//按键初始化函数
void KEY_Init(void)
{
	RCC->APB2ENR|=1<<0;			//使能辅助时钟
	RCC->APB2ENR|=1<<4;    //使能PORTC时钟	   	 
	GPIOC->CRL&=0XFFFFFFF0; 
	GPIOC->CRL|=0X00000008;//PC0 输入   	 
  GPIOC->ODR|=1<<0;      //PC0 上拉 
} 


/*************************************END************************************/
