/***************************************************************************
本程序可供学习使用，经作者允许，也可用于其他用途。如有意见及建议，欢迎来电交流指教
硬件说明：四路麦轮多功能控制板
主控芯片：STM32F103RCT6
程序名称：外部中断实验程序
功能描述：按键作为外部中断信号输入。通过外部中断，控制LED灯亮灭


*****************************************************************************/



#include "sys.h"
#include "delay.h"
#include "led.h"
#include "exit.h"

unsigned char LED_sta=0;

int main(void)
{		
  Stm32_Clock_Init(9);//系统时钟设置
	delay_init(72);			//延时初始化
	LED_Init();         //LED初始化	
	Exit_Init();        //外部中断初始化
 
	while(1)
	{
		
	} 
}

//外部中断0复服务程序
void EXTI0_IRQHandler(void)
{	
//简单的防抖处理
	delay_ms(5);
	if(KEY!=0)
	{
		EXTI->PR=1<<0;  //清除LINE0上的中断标志位
		return;
	}
	LED0=~LED0;

	EXTI->PR=1<<0;  //清除LINE0上的中断标志位
}



/*************************************END************************************/







