/***************************************************************************
本程序可供学习使用，经作者允许，也可用于其他用途。如有意见及建议，欢迎来电交流指教
主控芯片：STM32F103RCT6
程序名称：延时程序
功能描述：延时


*****************************************************************************
修改说明：
2019/09/16 删除ucos延时相关代码，使程序更简化


*****************************************************************************/

#ifndef __DELAY_H
#define __DELAY_H 			   
#include "sys.h"  
	 
void delay_init(u8 SYSCLK);
void delay_ms(u16 nms);
void delay_us(u32 nus);

#endif



/*************************************END************************************/



