/***************************************************************************
本程序可供学习使用，经作者允许，也可用于其他用途。如有意见及建议，欢迎来电交流指教
硬件说明：四路麦轮多功能控制板
主控芯片：STM32F103RCT6
程序名称：外部中断程序


*****************************************************************************/


#include "exit.h"


						    
//外部中断初始化函数
void Exit_Init(void)
{
	RCC->APB2ENR|=1<<0;			//使能辅助时钟
	RCC->APB2ENR|=1<<4;    	//使能PORTC时钟	   	 
	GPIOC->CRL&=0XFFFFFFF0; 
	GPIOC->CRL|=0X00000008;	//PC0 输入   	 
  GPIOC->ODR|=1<<0;      	//PC0 上拉 
	
	Ex_NVIC_Config(GPIO_C,0,FTIR); 		//下降沿触发
	MY_NVIC_Init(0,0,EXTI0_IRQn,2);   //抢占2，子优先级2，组2	
} 


/*************************************END************************************/


