/***************************************************************************
本程序可供学习使用，经作者允许，也可用于其他用途。如有意见及建议，欢迎来电交流指教
硬件说明：四路麦轮多功能控制板
主控芯片：STM32F103RCT6
程序名称：USART1收发实验--主程序
功能描述：USART1收发实验，串口回显，将接受到的数据，原样发送回来


*****************************************************************************/



#include "sys.h"	
#include "delay.h"	
#include "usart.h"


int main(void)
{		
  Stm32_Clock_Init(9);		//系统时钟设置，8.0000MHz晶振，9倍倍频，主频=8.0000MHz*9=72.0000MHz 
	delay_init(72);					//延时初始化
	USART1_Init(72,115200);	//初始化串口波特率为115200 
	USART1_SendString("STM32 USART1收发实验\r\n");
	USART1_SendString("串口回显，将接受到的数据，原样发送回来\r\n");
	while(1)						//主循环
	{

	} 
}


//USART1中断服务程序	 
void USART1_IRQHandler(void)
{ 		    		  			    
	u8 res;	
	if(USART1->SR&(1<<5))		//接收到数据
	{	 
		res=USART1->DR; 			//接收到的数据暂存在res变量中
		USART1_SendChar(res);	//将res串口发送出去												
	}		
}

/*************************************END****************************************/





