/***************************************************************************
本程序可供学习使用，经作者允许，也可用于其他用途。如有意见及建议，欢迎来电交流指教
硬件版本：四路麦轮多功能控制板
主控芯片：STM32F103RCT6
程序名称：PWM输出驱动舵机实验--舵机驱动程序
功能描述：扩展PWM接口输出，驱动四路舵机



*****************************************************************************/


#ifndef __MOTOR_H__
#define __MOTOR_H__

#include "sys.h"

#define PWM_MAX 4499

#define PWM_DIR PAout(5)

void Servo_Init(void);		
void Set_Servo(int Servo1,int Servo2,int Servo3,int Servo4);

#endif

/*************************************END************************************/



